
"""
Convert Number to Thai Text.
เขียนโปรแกรมรับค่าจาก user เพื่อแปลง input ของ user ที่เป็นตัวเลข เป็นตัวหนังสือภาษาไทย
โดยที่ค่าที่รับต้องมีค่ามากกว่าหรือเท่ากับ 0 และน้อยกว่า 10 ล้าน

*** อนุญาตให้ใช้แค่ตัวแปรพื้นฐาน, built-in methods ของตัวแปรและ function พื้นฐานของ Python เท่านั้น
ห้ามใช้ Library อื่น ๆ ที่ต้อง import ในการทำงาน(ยกเว้น ใช้เพื่อการ test การทำงานของฟังก์ชัน).

"""


if __name__=='__main__':

    while True:
        print("\n")
        print("ถ้าต้องการออกจากลูปใส่ 'exit' ")
        numbers = input("เลขอารบิคที่ต้องการแปลงเป็นเลขไทย:")

        if numbers == 'exit':
            break
        else:
            int_numbers = int(numbers)
            millions = ['', 'หนึ่งล้าน', 'สองล้าน', 'สามล้าน', 'สี่ล้าน', 'ห้าล้าน', 'หกล้าน', 'เจ็ดล้าน', 'แปดล้าน', 'เก้าล้าน']
            hundred_thousands = ['', 'หนึ่งแสน', 'สองแสน', 'สามแสน', 'สี่แสน', 'ห้าแสน', 'หกแสน', 'เจ็ดแสน', 'แปดแสน', 'เก้าแสน']
            ten_thousands = ['', 'หนึ่งหมื่น', 'สองหมื่น', 'สามหมื่น', 'สี่หมื่น', 'ห้าหมื่น', 'หกหมื่น', 'เจ็ดหมื่น', 'แปดหมื่น', 'เก้าหมื่น']
            thousands = ['', 'หนึ่งพัน', 'สองพัน', 'สามพัน', 'สี่พัน', 'ห้าพัน', 'หกพัน', 'เจ็ดพัน', 'แปดพัน', 'เก้าพัน']
            hundreds = ['', 'หนึ่งร้อย', 'สองร้อย', 'สามร้อย', 'สี่ร้อย', 'ห้าร้อย', 'หกร้อย', 'เจ็ดร้อย', 'แปดร้อย', 'เก้าร้อย']
            tens = ['', 'สิบ', 'ยี่สิบ', 'สามสิบ', 'สี่สิบ', 'ห้าสิบ', 'หกสิบ', 'เจ็ดสิบ', 'แปดสิบ', 'เก้าสิบ']
            units = ['', 'เอ็ด', 'สอง', 'สาม', 'สี่', 'ห้า', 'หก', 'เจ็ด', 'แปด', 'เก้า']

            if int_numbers > 9999999:
                print("Error, ค่าที่รับมาเกิน 9,999,999")
                
            elif int_numbers > 1 and int_numbers < 10000000:
                th7 = millions[int_numbers//1000000]
                th6 = hundred_thousands[(int_numbers%1000000)//100000] 
                th5 = ten_thousands[(int_numbers%100000)//10000]
                th4 = thousands[(int_numbers%10000)//1000]
                rd3 = hundreds[(int_numbers%1000)//100]
                nd2 = tens[(int_numbers%100)//10]
                st1 = units[(int_numbers%10)//1]           
                result = th7 + th6 + th5 +th4 + rd3 + nd2 + st1
                print(f"ตัวเลขอักษรไทย: {result}")
            
            elif int_numbers == 1:
                print("หนึ่ง")
            elif int_numbers == 0:
                print("ศูนย์")
            else:
                print("ค่าที่รับมาติดลบ")

    


